[
  {
    "title": "Do Boat and Ocean Suggest Beach? Dialogue Summarization with External Knowledge",
    "authorids": [
      "~Tianqing_Fang1",
      "myscarletpan@gmail.com",
      "~Hongming_Zhang2",
      "~Yangqiu_Song1",
      "kxkunxu@tencent.com",
      "~Dong_Yu2"
    ],
    "authors": [
      "Tianqing Fang",
      "Haojie Pan",
      "Hongming Zhang",
      "Yangqiu Song",
      "Kun Xu",
      "Dong Yu"
    ],
    "keywords": [
      "Dialogue Summarization",
      "Knowledge Attention"
    ],
    "TL;DR": "We address the problem of out-of-context inference in dialogue summarization, and propose a knowledge-aware model tackling this issue.",
    "abstract": "In human dialogues, utterances do not necessarily carry all the details. As pragmatics studies suggest,  humans can infer meaning from the situational context even though the meaning is not literally expressed.  It is crucial for natural language processing models to understand such an inference process. In this paper, we address the problem of inferencing Concepts Out of the Dialogue Context (CODC) in the dialogue summarization task. We propose a novel framework comprised of a CODC inference module leveraging external knowledge from WordNet and a knowledge attention module aggregating the inferred knowledge into a neural summarization model. To evaluate the inference capability of different methods, we also propose a new evaluation metric based on CODC. Experiments suggest that current automatic evaluation metrics of natural language generation may not be enough to understand the quality of out-of-context inference in generation results, and our proposed summarization model can provide statistically significant improvements on both CODC inference and traditional automatic evaluation metrics, e.g., CIDEr. Human evaluation of the model's inference ability also demonstrates the superiority of the proposed model.",
    "pdf": "/pdf/b29b9ffdba733bdab5f426bf437bb85d3f3b7143.pdf",
    "subject_areas": [
      "Applications"
    ],
    "archival_status": "Archival",
    "supplementary_material": "",
    "paperhash": "fang|do_boat_and_ocean_suggest_beach_dialogue_summarization_with_external_knowledge",
    "venue": "AKBC 2021",
    "venueid": "AKBC.ws/2021/Conference",
    "_bibtex": "@inproceedings{\nfang2021do,\ntitle={Do Boat and Ocean Suggest Beach? Dialogue Summarization with External Knowledge},\nauthor={Tianqing Fang and Haojie Pan and Hongming Zhang and Yangqiu Song and Kun Xu and Dong Yu},\nbooktitle={3rd Conference on Automated Knowledge Base Construction},\nyear={2021},\nurl={https://openreview.net/forum?id=AJKd0iIFMDc}\n}",
    "forum_id": "AJKd0iIFMDc",
    "UID": "18",
    "author_profiles": [
      "~Tianqing_Fang1",
      "",
      "~Hongming_Zhang2",
      "~Yangqiu_Song1",
      "",
      "~Dong_Yu2"
    ],
    "doi": "doi:10.24432/C5Z30M"
  }
  ]
